# Introducing the Pandas DataFrame

In [2]:
import pandas as pd

In [5]:
data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai', 'Manchester', 'Cairo', 'Osaka'],
    'age': [41, 28, 33, 34, 38, 31, 37],
    'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]
 }

index = range(101, 108)

In [6]:
df = pd.DataFrame(data, index=index)

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.index

RangeIndex(start=101, stop=108, step=1)

In [9]:
df.columns

Index(['name', 'city', 'age', 'py-score'], dtype='object')

In [10]:
type(df.columns)

pandas.core.indexes.base.Index

In [11]:
df.head()
df.tail()

      name        city  age  py-score
103   Jana      Prague   33      81.0
104     Yi    Shanghai   34      80.0
105  Robin  Manchester   38      68.0
106   Amal       Cairo   31      61.0
107   Nori       Osaka   37      84.0

In [12]:
df.head()

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0

In [13]:
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [14]:
df['city']

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [15]:
type(df['city'])

pandas.core.series.Series

In [16]:
cities = df['city']

In [17]:
cities

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [18]:
cities.index

RangeIndex(start=101, stop=108, step=1)

In [19]:
cities[102]

'Toronto'

In [20]:
df.age

101    41
102    28
103    33
104    34
105    38
106    31
107    37
Name: age, dtype: int64

In [21]:
df.age[105]

38

In [22]:
df.loc[105]

name             Robin
city        Manchester
age                 38
py-score          68.0
Name: 105, dtype: object

In [23]:
df.loc[105]['city']

'Manchester'

## Creating a pandas df

In [24]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [25]:
pd.DataFrame

pandas.core.frame.DataFrame

In [26]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [27]:
import numpy as np

In [28]:
d = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}

In [29]:
d

{'x': [1, 2, 3], 'y': array([2, 4, 8]), 'z': 100}

In [30]:
pd.DataFrame(d, index = [100, 200, 300], columns = ['z', 'y', 'x'])

       z  y  x
100  100  2  1
200  100  4  2
300  100  8  3

In [31]:
lista = [{'x': 1, 'y': 2, 'z': 100}, {'x': 2, 'y': 4, 'z': 100}, {'x': 3, 'y': 8, 'z': 100}]

In [32]:
lista

[{'x': 1, 'y': 2, 'z': 100},
 {'x': 2, 'y': 4, 'z': 100},
 {'x': 3, 'y': 8, 'z': 100}]

In [33]:
second_pd = pd.DataFrame(lista, index = ['r1', 'r2', 'r3'])

In [34]:
second_pd

    x  y    z
r1  1  2  100
r2  2  4  100
r3  3  8  100

In [35]:
list2 = l = [[1, 2, 100], [2, 4, 100], [3, 8, 100]]

In [36]:
list2

[[1, 2, 100], [2, 4, 100], [3, 8, 100]]

In [37]:
  third_pd = pd.DataFrame(list2, columns = ['XX', 'YY', 'ZZ'])

In [38]:
third_pd

   XX  YY   ZZ
0   1   2  100
1   2   4  100
2   3   8  100

In [39]:
arr = np.array([[1, 2, 100], [2, 4, 100], [3, 8, 100]])

In [40]:
arr

array([[  1,   2, 100],
       [  2,   4, 100],
       [  3,   8, 100]])

In [41]:
df_4 = pd.DataFrame(arr, columns = ['a', 'b', 'c'])

In [42]:
df_4

   a  b    c
0  1  2  100
1  2  4  100
2  3  8  100

In [43]:
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [49]:
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [54]:
new_df = pd.read_csv('job_candidates.csv', index_col=1)

In [58]:
new_df

        Unnamed: 0         city  age  py-score
name
Xavier         101  Mexico City   41      88.0
Ann            102      Toronto   28      79.0
Jana           103       Prague   33      81.0
Yi             104     Shanghai   34      80.0
Robin          105   Manchester   38      68.0
Amal           106        Cairo   31      61.0
Nori           107        Osaka   37      84.0

In [59]:
new_df.loc['Ann']

Unnamed: 0        102
city          Toronto
age                28
py-score         79.0
Name: Ann, dtype: object

In [60]:
new_df.index

Index(['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'], dtype='object', name='name')

In [61]:
new_df.columns

Index(['Unnamed: 0', 'city', 'age', 'py-score'], dtype='object')

In [65]:
new_df = pd.read_csv('job_candidates.csv', index_col = 0)